//==============================================================================
#ifndef _RELAY_SERVICE_RX_TRANSACTIONS_H_
#define _RELAY_SERVICE_RX_TRANSACTIONS_H_
//------------------------------------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif 
//==============================================================================
//includes:

#include "Common/xRxTransaction.h"
//==============================================================================
//types:

/**
 * @brief перечисление запросов возможных ActionKey
 */
//------------------------------------------------------------------------------

extern const xRxRequestT RelayServiceRxRequests[];
//==============================================================================
#ifdef __cplusplus
}
#endif
//------------------------------------------------------------------------------
#endif //_RELAY_SERVICE_RX_TRANSACTIONS_H_
